/**
 * Пакет содержит интерфейсы для определения API методов анализа резюме.
 * Эти интерфейсы предоставляют спецификации для реализации конечных точек REST API,
 * отвечающих за обработку различных типов анализа резюме, таких как комплексный анализ,
 * анализ структуры, ясности изложения, стабильности карьерного пути, соответствия вакансии и другие.
 * Интерфейсы используют аннотации Swagger для автоматической генерации документации API.
 *
 * @author surkov
 */
package org.surkov.gigachatservice.controller.hr_analyzer.api;